---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoSolutionInView
source: html/dc12a791-f27a-7ba0-5f1e-d475c1d5e2d4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NoSolutionInView Property

There is no solution for this view. All the elements have been filtered for this view, select another view, and select solutions.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoSolutionInView { get; }
```